12/data/attachments/7ec761e0b6bff42a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_ccb6364d-4e0a-4708-8176-7131e5e87116</nif:username>
            <nif:friendToBeAdded>James_surface_Friend_38006_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>